okonch = ['ит', 'ат', 'ят', 'ишь', 'ите', 'у', 'ю', 'им', 'ет', 'ут', 'ют',
          'ьи', 'ов', 'ев', 'ей', 'ого', 'его',
          'ой', 'ей', 'ых', 'их', 'ью', 'ам', 'ям', 'ому', 'ему', 'ой', 'ей', 'ым', 'им', 'ей', 'ой', 'ий',
          'ый', 'ую', 'юю', 'ое', 'ее', 'ого', 'его', 'ой', 'ей', 'ые', 'ие', 'ых', 'их', 'ой', 'ей', 'ом',
          'ем', 'ами', 'ями', 'им', 'ым', 'ой', 'ей', 'ыми', 'ими', 'ах', 'ях', 'ом', 'ем', 'ой', 'ей', 'ых', 'их',
          'йся', 'мся', 'юсь', 'оря', 'шая', 'яся', 'ося', 'ееся', 'ейся', 'муся', 'еюся', 'иеся', 'ийся', 'ися',
          'хся', 'юся', 'яе', 'мая', 'ости', 'мость', 'емся', 'ете', 'есь', 'ется', 'яешь', 'ешься',
          'яй', 'йся', 'йте', 'ял', 'яла', 'ась', 'яли', 'ись', 'ло', 'лось', 'лс', 'лся', 'яля', 'тся', 'ять', 'ься',
          'юсь', 'ются', 'ющая', 'аяся', 'гося', 'еся', 'ейся', 'емся', 'уся', 'еюся', 'йся', 'ися', 'мся', 'хся', 'ма',
          'ме', 'мы', 'ская', 'ески', 'ная', 'но', 'ность', 'ента', 'енте',
          'овав', 'овал', 'овала', 'овали', 'ован', 'ована', 'овании', 'ования', 'ованная',
          'ованность', 'овано', 'ованы', 'овать', 'овка', 'овке', 'овки', 'уешь', 'уй', 'уя', 'уясь', 'чик',
          'чика', 'чике', 'чики', 'ы', 'е', 'и', 'к', 'кая', 'е', 'ы', ]
with open('russian_edit.txt', 'w', encoding='utf-8') as new:
    with open('russian.txt', 'r', encoding='utf-8') as old:
        for line in old:
            word = line.strip()
            if len(word) < 4:
                continue
            for oko in okonch:
                if word.endswith(oko):
                    break
            else:
                new.write(word + '\n')
